{
    "model": {
        "id": 265,
        "name": "M7151_EN",
        "serial": "M7151",
        "title": "The powerful high performer",
        "description": "<p>The Kubota M7001 is the high performer in the professional tractor market. With its powerful 6.1 l Kubota engine, the extraordinarily powerful lift capacity and extensive potential for precision farming, the top model sets a whole new benchmark. Add to this first-class comfort and surprising operator convenience, efficient farming has never been this easy. Put its talents to use and reach top performance with ease.</p>\r\n",
        "created_at": "2017-10-20 12:36:04",
        "updated_at": "2017-11-07 09:36:31",
        "series_id": "2",
        "image_360_front": "360/050d138434b98aba4ed34577efbb6dd6.png",
        "image_360_right": "360/2408e9d0429d901d63eebad944463822.png",
        "image_360_rear": "360/f46dcc4b61494c3440c1d7232575e56f.png",
        "image_360_left": "360/1f3c3bbc6c952f715278e6296f6cd6c5.png",
        "locale": "EN",
        "unit": "150 hp",
        "control_link_1": "tractor_terminals",
        "control_link_2": "retro_fit_terminals",
        "control_link_3": null,
        "optimization_link_1": "guidance",
        "optimization_link_2": null,
        "optimization_link_3": null,
        "value_link_1": "value_protection",
        "value_link_2": null,
        "value_link_3": null,
        "finance_link_1": "finance_management",
        "finance_link_2": null,
        "finance_link_3": null,
        "touchpoints": [
            {
                "id": 1786,
                "machine_id": 265,
                "created_at": null,
                "updated_at": null,
                "name": "M7151_2_EN",
                "label": "Engine",
                "content": "<p>Kubota&rsquo;s 4 valve per cylindre 6.1-litre diesel engines have a long piston stroke. The E-CDIS (Central Direct Injection System) produces a combination of power and efficient fuel consumption, less noise and vibration. The common rail system (CRS) controls the injection timing and the amount of fuel injected in stages under high pressure for optimal combustion.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Advantageous torque</strong></p>\r\n\r\n<p>The Kubota engine has an excellent maximum low-end torque at 1,400 rpm. Its performance curve is best in its class and provides advantages for all power take-off (PTO) implements.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Clean engine technology</strong></p>\r\n\r\n<p>The robust V6108 engine is equipped with an SCR exhaust after-treatment system (AdBlue&reg;). The combination of this technology with a diesel particulate filter (DPF) muffler and an exhaust gas recirculation (EGR) system ensures that the M7001 clearly exceeds the requirements of the latest Stage IV Final emission standards.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Lower fuel consumption</strong></p>\r\n\r\n<p>The four-cylinder engine in the M7001 has a very efficient fuel consumption for its power. Lower fuel demand, together with reduced AdBlue&reg; consumption, results in long operating times.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>More power with Power Boost</strong></p>\r\n\r\n<p>The M7001 offers additional power to maintain maximum working performance. If a short-term performance increase is needed for exceptionally heavy work during PTO or transport applications, the M7001&rsquo;s Power Boost will immediately deliver more power to the tractor.</p>\r\n",
                "deleted_at": null,
                "image_1": "touchpoints/c98c81b8377e0f5015afea4c9c06af33.jpg",
                "image_2": "touchpoints/b50177c929ce698439935cb005bf330d.jpg",
                "image_3": "touchpoints/744dfa283aca8553a8fbc897a5586918.jpg",
                "image_4": null,
                "locale": "EN",
                "number": "2",
                "type": "text + images",
                "table_image": null,
                "content_2": null
            },
            {
                "id": 1787,
                "machine_id": 265,
                "created_at": null,
                "updated_at": null,
                "name": "M7151_4_EN",
                "label": "Cab",
                "content": "<p><strong>New perspectives</strong></p>\r\n\r\n<p>With only four pillars, rounded rear fender, and a forward-sloped bonnet, the front, back, and side view is excellent. All control levers, switches, and buttons in the cab are arranged logically, are easily recognisable, and within comfortable reach. The large LCD display on the dashboard provides a clear and precise overview of all the information required for operating the tractor. Even a first-time driver will appreciate the easiness.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>The perfect command centre</strong></p>\r\n\r\n<p>The spacious cab is amongst the largest in its category. On top of outstanding spaciousness, it also has great comfort, an impressive operating concept, and exceptional panoramic visibility, allowing you to focus.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Optimal comfort on long work days</strong></p>\r\n\r\n<p>Front axle and cab suspension serve to treat both driver and machine with care, resulting in high productivity. The M7001 is available without cab suspension, or can be supplied with two different suspension options: a mechanical suspension system or a pneumatic suspension system.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Choice of cab suspension</strong></p>\r\n\r\n<p>The cab of the M7001 offers a mechanical suspension system as an option. A pneumatic suspension system is also available. The cab suspension has +/&minus;45 mm of spring travel and reliably softens even hard impacts while underway &ndash; either on the road or in the field.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Peace and quiet</strong></p>\r\n\r\n<p>The well-insulated cab (72 dB(A)) lets in very little noise enter. This allows you to focus and work in peace all day long.</p>\r\n",
                "deleted_at": null,
                "image_1": "touchpoints/d4f749d16066e637ba0656cc18a52872.jpg",
                "image_2": "touchpoints/fcef460ef6b9b8c42e6981e8a9edaa39.jpg",
                "image_3": null,
                "image_4": null,
                "locale": "EN",
                "number": "4",
                "type": "text + images",
                "table_image": null,
                "content_2": null
            },
            {
                "id": 1788,
                "machine_id": 265,
                "created_at": null,
                "updated_at": null,
                "name": "M7151_5_EN",
                "label": "Traction",
                "content": "<p><strong>Consistently on track for success: reach your goals with ease in the M7001</strong></p>\r\n\r\n<p>Hard ploughing work, quick transport trips, or frequent front loader work in tight farmyards &ndash; with its excellent traction, extremely high driving stability, and excellent maneuverability, the M7001 comes through even on tough assignments. With the Kubota M7001, you&rsquo;re sure to meet your objectives, no matter how daunting the task.</p>\r\n\r\n<p>The front axle and cab suspension of the M7001 improve productivity with increased traction and driving comfort. The optional front axle suspension of the tractor helps to apply greater force to the ground. The tractive power is optimally transferred &ndash; an advantage when ploughing heavy soils, among other things. The front axle suspension not only results in better traction and more driving comfort, but also ensures safe driving behavior. This provides additional safety for faster road travel. When ON / OFF in automatic mode, the suspension system automatically adapts to the current load.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Auto-differential locks engage electro hydraulically</strong></p>\r\n\r\n<p>The auto-differential locks on the front and rear axles of the M7001 are engaged electro hydraulically and ensure the best possible traction, even under poor soil conditions.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Excellent maneuverability</strong></p>\r\n\r\n<p>Despite its considerable wheelbase of 2.72 m, the M7001 has a steering angle of 55 degrees, making it extremely agile. As a result, the tractor can be maneuvered even in tight farmyards and headlands.</p>\r\n",
                "deleted_at": null,
                "image_1": "touchpoints/f60f4e01951e6bd576581fd1562bf9c2.jpg",
                "image_2": null,
                "image_3": null,
                "image_4": null,
                "locale": "EN",
                "number": "5",
                "type": "text + images",
                "table_image": null,
                "content_2": null
            },
            {
                "id": 1789,
                "machine_id": 265,
                "created_at": null,
                "updated_at": null,
                "name": "M7151_6_EN",
                "label": "Hydraulics/Linkage/Connectivity",
                "content": "<p><strong>High lift capacity</strong></p>\r\n\r\n<p>The M7001&rsquo;s tremendous lift capacity of 9,400 kg lets you work quickly with drill combinations and other heavy implements such as ploughs, cultivators, and the like. The front linkage with a capacity of 3,500 kg provides additional lift capacity so you can easily tackle jobs that require heavy implements.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>At the right speed</strong></p>\r\n\r\n<p>You can select between four speeds (540/540E/1000/1000E) for the PTO speed, allowing you to save fuel while running a variety of implements. The large selection of PTO speeds makes the M7001 very ﬂexible and you can also engage or disengage it from the external fender.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Automatic PTO engagement</strong></p>\r\n\r\n<p>You will appreciate the ease and precision of the automatic PTO engagement (on Premium models) when it&rsquo;s time to turn around at the end of the ﬁeld. Auto PTO disengages the PTO shaft automatically for headland turns, when the three-point hydraulics system is lifted, and engages it again automatically when lowered.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>PTO shaft and front linkage on request</strong></p>\r\n\r\n<p>The M7001 can be optionally equipped with a front PTO shaft with 1,000 rpm PTO speed. This allows the ﬂexible use of front implements, such as a front mower or metering tank for fertiliser or seeder.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Easy to operate</strong></p>\r\n\r\n<p>The rear electronic linkage control is ergonomically integrated into the multifunction lever. The hydraulic controls are therefore easy to reach and operate. The external remote controls on the external fender facilitates the coupling and uncoupling of implements.</p>\r\n",
                "deleted_at": null,
                "image_1": "touchpoints/aece883d27541930bd4e5c8c758a3286.jpg",
                "image_2": "touchpoints/06d1bbb5f254772901facf8b3134d19d.jpg",
                "image_3": null,
                "image_4": null,
                "locale": "EN",
                "number": "6",
                "type": "text + images",
                "table_image": null,
                "content_2": null
            },
            {
                "id": 1790,
                "machine_id": 265,
                "created_at": null,
                "updated_at": null,
                "name": "M7151_7_EN",
                "label": "Front Loader",
                "content": "<p><strong>The perfect combination of tractor and front loader</strong></p>\r\n\r\n<p>You beneﬁt from the fact that the tractor and the original Kubota front loader are perfectly matched and optimally complement each other. This tailor-made combination provides several advantages at once: smooth operation, ﬁrst-class controls, and maximum efﬁciency for front loader work.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Effortless operation</strong></p>\r\n\r\n<p>The front loader control is located on the M7001 Premium armrest for smooth and effortless operation. You can use several functions simultaneously thanks to the hydraulic technology. The tipper bucket control ensures rapid dumping. No need for long waiting times: the front loader can be attached or detached in minutes, without any tools.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Low-impact operation</strong></p>\r\n\r\n<p>The Kubota KSR (Kubota Shockless Ride) shock softening system helps to minimise vibrations.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Expanded hydraulic functions</strong></p>\r\n\r\n<p>Even with the basic equipment package, all M7001 front loaders have three functions as standard and a fourth function as an option for working with baling forks or other hydraulically activated front loader tools. The valve is activated by a conveniently located switch on the joystick.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Time-saving multi-coupler</strong></p>\r\n\r\n<p>Just pull the lever on the multi-coupler to quickly connect all hoses and cables at once. A front loader could hardly be easier to attach or detach.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Optimal view towards the front</strong></p>\r\n\r\n<p>The Z-mechanical self levelling is a feature taken from Kubota wheel loaders and is likewise integrated in the Z-kinematics. This system is more robust and allows a clear view towards the front.</p>\r\n",
                "deleted_at": null,
                "image_1": "touchpoints/2c2e77347194ba2141f398b4ab1121fa.jpg",
                "image_2": "touchpoints/52b6aa04d10cd334c33ca69f07e848e0.jpg",
                "image_3": null,
                "image_4": null,
                "locale": "EN",
                "number": "7",
                "type": "text + images",
                "table_image": null,
                "content_2": null
            },
            {
                "id": 1791,
                "machine_id": 265,
                "created_at": null,
                "updated_at": null,
                "name": "M7151_8_EN",
                "label": "Technical Data",
                "content": null,
                "deleted_at": null,
                "image_1": "touchpoints/d6a4b3c1d12507d51032eaea67154da1.jpg",
                "image_2": null,
                "image_3": null,
                "image_4": null,
                "locale": "EN",
                "number": "8",
                "type": "image-only",
                "table_image": "uploads/tabelle-M7151.svg",
                "content_2": null
            }
        ],
        "serie": {
            "id": 2,
            "name": "M7001_EN",
            "serial": "M7001",
            "title": "The powerful high performer",
            "content": "The Kubota M7001 is the high performer in the professional tractor market. With its extraordinarily powerful lift capacity and extensive potential for precision farming, the top model sets a whole new benchmark.",
            "created_at": null,
            "updated_at": "2017-10-03 20:29:17",
            "locale": "EN",
            "category": "performace"
        }
    }
}